"Walmart Thanks Government For Completely Obliterating Their Small Business Competition"
"This would literally kill me"
"After Trans Activists Try To Ban The Book 'Irreversible Damage,' It Becomes A Bestseller -- Trans activists keep bullying businesses into removing content through fear tactics rather than by countering the message with their own better one."
"Michigan's State Board of Canvassers votes to certify election"
"Rush Limbaugh criticizes Trump legal team for promising 'bombshells' and failing to deliver"
"Holocaust Museum In Florida Sparks Outrage After Adding George Floyd Exhibit"
"Pro-Trump Attorney Lin Wood Urges Republicans Not To Vote In Georgia Senate Runoff -- Unless GOP candidates help overturn the presidential election results in the state."
"Gavin Newsom Alerted To Illegal Activity By The Sound Of Children's Laughter"
"Harvard creating new 'antiracism' librarian job. It pays up to $240,300 per year."
"Michigan board certifies Nov. 3 election results as one GOP canvasser dissents"
"Trump Administration To Start Transition Process For Biden"
"White Anti-Racism Author Robin DiAngelo Paid More Than Black Woman To Speak At Same Diversity Forum"
"Bombshell: Biden takes min 98% of a 23,487 vote batch at 12:18AM in GA"
"Do Trump-Supporters Live in an Alternate Universe? Actually a huge number of Americans have a false impression of reality because they are being told lies by their media. The people who constantly hear these lies do live in an \"alternate reality.\""
"Nearly 40 Shot Friday into Sunday Morning in Lightfoot's Chicago"
"AOC suggests criticizing socialism is racist after reeling Dem colleagues blast radicalism"
"Climate Change Alarmist Harrison Ford Seen Landing Private Jet to Pick Up Son Ahead of Thanksgiving"
"U.S newspapers got paid millions to publish Chinese propaganda"
"'It Will Be Epic': Sidney Powell Releases Another Statement After Lawyers Say She's Not On Team"
"Wauwatosa Mayor: \"Guns have no place in shopping malls or other places in which crowds of people gather. Mayfair has a strict no-gun policy. If the shooter had complied with that policy, no one would have been hurt yesterday.\""
"Sidney Powell Confirms Non-Affiliation With Trump Legal Team, Vows to Continue Fraud Fight"
"Police Union Tells Embattled New York Subway Riders 'You're on Your Own' amid the recent rash of shoving incidents by unhinged assailants"
"'You're Such A D**k': New Jersey Gov Confronted Eating Maskless Outside With His Family"
"Trump campaign takes Pennsylvania election fight to federal appeals court"
"Sidney Powell Responds to Trump Campaign's Statement Saying She's Not Part of Legal Team -- Powell said her fight will go on anyway and closed her statement with the hashtag, \"#KrakenOnSteroids\""
"Bill Gates Smears Parler and its Users"
"A Neighbor You Like Probably Voted For Trump"
"Media Unveils Bold New Plan to Win Latino Support by Calling Them Racist"
"In Canada, you have to show ID and proof of address to vote in Federal elections"
"George Takei: 'I Want to Live in a Country Where Kaepernick is Seen as a Hero and Kyle Rittenhouse Is Seen as a Terrorist'"
"JUST IN: Third Circuit Court of Appeals Grants Expedited Review For Team Trump's Appeal in Pennsylvania"
"AOC Suggests Criticizing Socialism Is Racist After Reeling Dem Colleagues Blast Radicalism"
"In Apparent Glitch, Voting Machines Hunt Down And Murder Trump Supporters"
"Trump scores two wins as Michigan legislature, federal appeals court agree to election reviews"
"Trump campaign says Sidney Powell not a member of legal team"
"Beijing-Controlled News Outlet Paid US Newspapers Millions To Publish Propaganda This Year"
"Two-thirds of GOP voters support Trump running for president in 2024: survey"
"Calls for Britain to give asylum to Pakistani Christian girl forced to marry Muslim man who abducted and gang-raped her"
"Why The Left Can Be So Ridiculously Self-Righteous Without Realizing It -- What we saw in the lead up to the elections, and what we'll witness for years to come, is utter contempt for Trump voters and conservatives in general."
"If the 2020 Election Was Held in a Foreign Country, the State Department and Western Media Would Declare it \"Fraudulent\" -"
"Majority say they want GOP in control of Senate: poll"
"'Burn It Down' -- Activists in Seattle want to abolish police, prisons, and courts."
"Appeals Court Grants Expedited Review of Trump Campaign's Pennsylvania Lawsuit"
"Democrat House Losses Stemmed From Trump Increasing Voter Turnout: Rep. Richmond"
"Watergate journalist Carl Bernstein outs 21 Republican senators who 'privately' expressed 'extreme contempt' for Trump."
"Biden proposes John Poulos, CEO and President of Dominion Voting Systems, as Surgeon General and Head of Covid Analytics. Dominion will now be solely in charge of recording and keeping an exact count of what has become the most deadly virus in the history of the world."
"HISTORIC: Netanyahu Meets Saudi Prince in Saudi Arabia, Reports Say"
"Dominion CEO Admits In Testimony This Year to Congress: Machines Rely On Chinese Parts From 'Screen Interface Down To Chip Level'"
"Progressives Declare War on Asians, Meritocracy and STEM - Asian Dawn"
"Journalist Carl Bernstein names 21 GOP senators who 'privately expressed their disdain' for Trump"
"Another Democratic Governor Shuts Down State, Orders Masks Indoors And Outdoors"
"Victor Davis Hanson: A Time of Chaos Upon Chaos Atop Chaos -- There is a series of battles to come in January 2021, in 2022, and in 2024 that will be definitive, if the chaos of 2020 does not become even more chaotic."
"Trump's election lawsuit leads to 3rd Circuit grant for expedited review"
"Protesters take to the streets in California to bash Newsom's curfew orders"
"5 More Ways Joe Biden Magically Outperformed Election Norms"
"Fury Erupts as George Floyd Exhibit Opens at Holocaust Museum"
"Political Enemy List Trump Accountability Project Publicly Posted on Their Website"
"Trump Pulls Out Of Military Transparency Treaty With Russia, Europe"
"In threat to Iran, US sends heavy bombers to Middle East via Israel"
"Union Bosses Sink Bernie Sanders as Labor Secretary"
"Pennsylvania Bans Sale Of Alcohol At Bars, Restaurants Ahead Of Thanksgiving"
"Annoyed ABC Scolds Americans 'Not Listening,' Visiting Family on Thanksgiving"
"Pennsylvania bans alcohol sales at bars, restaurants on Thanksgiving Eve as COVID cases climb"
"America Needs A Special Counsel To Investigate Election Integrity, Stat -- With credible allegations of fraud compounding by the day, the American people deserve a special counsel investigation to set the record straight."
"Portman: No proof of mass fraud that would change election result"
"Viral Video: NJ Gov. Phil Murphy Confronted At Restaurant For Not Wearing Mask"
"The 2005 Carter-Baker Report Predicted Election Madness 15 Years Ago"
"GOP Former National Security Officials Urge Party to Demand Trump Concession"
"Biden's Treasury Secretary: Janet Yellen"
"Israel's Netanyahu, Saudi Crown Prince Hold First Known Meeting"
"Rush Limbaugh: Trump Needs to Hold Rallies in Georgia"
"Janet Yellen Is Biden's Pick for Treasury Secretary"
"ICYMI: Diebold, the company accused of rigging the 2004 election for Bush, was bought out by Dominion in 2010."
"Liberals' race rhetoric is a power grab"
"Newsom pressured to pick 'woman of color' to fill Senate seat. Former San Francisco Mayor Willie Brown is pushing Maxine Waters among others."
"Trump's legal team's statement on Sydney Powell was made to focus on the upcoming Supreme Court case. There are two separate legal pathways. One on equal protection and PA voting rules (most important right now). The second is Dominion software which will take longer."
"Lou Dobbs Warns the GOP: Republican Party 'Will Be Gone and Done' If They Don't Stand With President Trump"
"Propaganda, Election Fraud and the Death of Journalism"
"Georgia extends use of absentee ballot drop boxes for Jan. 5 runoff amid surge in requests"
"Late Justice Scalia's son blasts Harris for insinuating Catholic charity a hate group"
"WHO Director Dr. Tedros Moves the COVID-19 Goalposts Right Off the Playing Field. He wants you to know that vaccines won't really change anything in response to COVID-19. His statement defies the management of any virus and there is no science to support it."
"Antiracism Icon Robin DiAngelo Paid More Than Black Woman for Same Job"
"'You Can't Enforce' Thanksgiving Lockdowns, New Mexico Governor Says"
"George Soros-linked election software company lies about ties with Dominion | One America News Network"
"China now blaming Italy for starting Wuhan coronavirus pandemic"
"The Lancet says the PCR false positive rate is unknown but could be up to 4%. Others have suggested 5%. We are testing 1.5 million a day. That's a FP rate of 75,000 a day if the 5% is true. The more we test the more FP there are."
"Qantas Airlines First to Require COVID Vaccine for International Flyers: 'That's a Necessity'"
"Judge Denies Injunction for 'Black Only Relief Fund'"
"5 More Ways Joe Biden Magically Outperformed Election Norms"
"Trump: More Votes Than Voters in Key Swing States"
"Open Letter Calls on Harvard to Create 'System of Accountability' for Inviting Trump Admin Alums to Campus"
"'Joe Biden is a very weak President, could start wars': Chinese government advisor | World News - Times of India"
"Viral video shows New York business owners take defiant stand when health inspector barges inside: 'Go get a warrant'"
"Trump obsession: Democrats tweet about him 12,569 times to 486 about Biden"
"OVER- Michigan board votes to certify election results despite GOP calls to delay"
"\"Georgia Is the First State I'm Going to Blow Up and Mr. Kemp and the Secretary of State Need to Go With It!\" - Sidney Powell"
"Putin Says He's Not Ready to Recognize Biden as U.S. President"
"GOP Likely to Gain Third US House Seat in California"
"Sidney Powell responds to Trump Campaign legal statement with agreement but an 'epic' lawsuit is still coming this week"
"HBO talkshow host Bill Maher slams Democrats for hypocrisy on COVID-19 protocol -- 'They keep getting caught doing what we're not allowed to do.'"
"COVID-19 vaccines could be required for certain jobs"
"Civil Disobedience: WATCH Angry business owners RESIST Cuomo's enforcement visit by Health Dept, Sheriff * The Savage Nation"
"In Oregon Crack cocaine was legalized in a November 3rd referendum along with all other illicit drugs while plastic straws were prohibited. The Oregon Health Authority however wants people to stay safe and remember to pull your mask back into place between puffs on your crack pipe."
"Left-Wing Activist And Actress Alyssa Milano Warned Against Electronic Voting Machines in 2018: 'We Need Paper Ballots'"
"Joel Kotkin: The Green End Game Runs Through Biden"
"WSJ Editorial Board: Stockton, CA elects Republican Mayor vowing safer streets"
"New York Democratic Leaders Caught Maskless At Private Party Despite COVID Restrictions"
"After Pelosi Claims She Wants To Provide Relief - Records Show 40 Times The House Democrats Blocked Relief Aid"
"California School District Bans Use of Classic Books in Classroom Over Racism Complaints"
"How Trump Responded When Liz Cheney Called on Him to Concede: \"Sorry Liz, can't accept the results of an election with hundreds of thousands of fraudulent votes cast, enough to easily flip the Election. You're just unhappy that I'm bringing the troops back home where they belong!\""
"Michael Flynn: Sidney Powell temporarily suspended from Twitter"
"Dominion Voting Systems says it is 'physically impossible' for their machines to switch votes for candidates"
"Business Owners March Against Governor Murphy's Executive Orders"
"CDC Advises Family Households To Ostracize College Students Returning Home For Thanksgiving"
"Obama's third term: Biden reveals first cabinet picks"
"Trump campaign demands recount, signature matching in Georgia"
"DC bill wants to allow kids to take vaccines without parents"
"Trump Campaign Formally Requests a Recount in Georgia"
"The Latest Memorial to George Floyd Is in a Holocaust Museum"
"UK Physician - \"Frankly, if it had not been for mainstream media and the government, I would not have even noticed there were a pandemic. I experienced no excessive dying, and no excessive becoming seriously ill.\""
"Will Republicans Learn From The 2020 Election?"
"2005 Carter-Baker Report Could Have Averted Problems With 2020 Voting"
"Statement from Sidney Powell to \"WE THE PEOPLE\""
"Election Fraud Is Too Important To Be Left To Conspiracy Theorists"
"House GOP wins suggests party growth, possible majority in 2022 | One America News Network"
"AOC: Does anyone believe Rittenhouse would be released if he were Muslim &amp; did the same thing in a diff context? For people who say 'systemic racism doesn't exist,' this is what it looks like: protection of white supremacy baked deep into our carceral systems."
"Florida Holocaust Museum sparks fury by adding George Floyd exhibit"
"LORD SUMPTION: Wrong for government to tell us what to do at Christmas"
"Appeals Court Grants Expedited Review of Trump Campaign's Pennsylvania Lawsuit"
"Oregon governor backs idea of alerting authorities on neighbors who violate COVID-19 restrictions"
"Federal judge dismisses Trump campaign's Pennsylvania case"
"Court Rules Tennessee Can Outlaw Down Syndrome, Race, and Gender Abortions"
"AOC calls out Kyle Rittenhouse's $2 million bail release as 'protection of white supremacy'"
"Latinos in South Texas Voted Against Illegal Immigration and CBP Demonization"
"Banks Give Black-Owned Businesses Advantage on Supply-Chain Finance Terms. Programs spring from multibillion-dollar commitments banks made to expand lending and investment after Black Lives Matter protests this year"
"Professor causes uproar asking Biden voters to unfriend him"
"Kevin McCarthy: Voters Have Rejected Pelosi's 'Socialist' Agenda"
"Sidney Powell Releases Statement"
"School allows boy into girls locker room while girls cry their privacy will be violated"
"The U.S. has withdrawn from the Treaty on Open Skies"
"Mike Flynn Jr. adds twist to Trump team's statement on Sidney Powell: 'Give this the 24hr rule ...'"
"Do as I say, not as I do: California's top Democrats display their hypocrisy over COVID-19"
"China Proposes Global 'Track and Trace' System for Travel Reset"
"Eyes rolling so hard that I can see the back of my skull. I guess pollution is racist now too!"
"Gov. Kemp calls for signature audit of Georgia vote"
"Sidney Powell Is an American Legal Giant -- She is fighting for our Republic right now because - make no mistake - honest American elections, and the continuing viability of our democracy, is on the line."
"Lib Priest's Bashing of ACB's Latest Decision Accidentally Admits We Were Right All Along"
"Stacey Abrams: 'More than 750,000' Georgians Requested Ballots for Runoff"
"Mass Protest at CNN: Your Fake News Gig Is Up"
"CA-25: Garcia(R) declares victory, Smith declines to concede"
"A dozen compelling allegations of voting irregularities in 2020 election"
"Miami Herald warning on Smartmatic 3/29/2006: 'Software engineers with links to the Leftist, anti-American regime of Hugo Chavez are in charge of programming electronic voting machines that will soon power U.S. elections'"
"Iowa's GOP Miller-Meeks Leads By 50 Votes In Nation's Closest House Race"
"The Government's Reckless Student Lending is Creating a Budget Hole Akin to the 2008 Crisis, New Analysis Shows"
"Joseph Stalin To Receive International Emmy For His Outstanding Hunger Relief Efforts"
"Pope Francis hosts NBA players to talk social justice."
": Election 2020 -- Are we witnessing the beginning of the end of wokeism?"
"BREAKING: FDA Grants Emergency Use Authorization To Antibody Cocktail Used By Trump"
"5 NBA Players Meet With Pope Francis To Talk Social Justice"
"Brooklyn political elite ignore COVID-19 rules at birthday party for Carlo Scissura"
"How to explain Latino support for Trump? ABC News reports misleading memes went viral in Latino communities"
"Let's talk about the \"where is the evidence\" meme"
"High family income, not SAT scores, is your real ticket to Harvard, Yale, and Princeton"
"Julie Burchill: President Trump has loved and been great for Israel"
"Kevin McCarthy: Voters Have Rejected Pelosi's 'Socialist' Agenda"
"Reap What You Sow: Media Who Coddled Biden for Months Now Complain About Mistreatment"
"Illinois Governor Pritzker Snubs Lori Lightfoot's \"Do Not Travel\" Advisory. He May Leave Chicago For Thanksgiving"
"Mark Levin educates on civil litigation for the ignorant talking heads"
"Lawmakers, Experts Warned of Election Vulnerabilities Years Ago"
"CNN Drowned Out by Protesters Chanting 'CNN Sucks! CNN Sucks!'"
"Conservatives, speak up"
"Omar Urges Biden To Reverse Trump's Agreements In The Middle East And Claims They Were \"Not Peace Deals\""
"The Fight Ahead: Our Media Is Trash. Their Words Are Worth Nothing. The fight ahead is real."
"AOC slams Kyle Rittenhouse's release on $2M bond as 'law and disorder'"
"France: Macron and his Islamic Rivals | Jayzoq"
"Private employers have qualified right to mandate employee COVID-19 vaccination"
"Devout Catholic Joe Biden, our most pro-abortion president"
"Religion, Liberty, and Religious Liberty. Macron is pushing France to confront the implications of Islamism for liberal democracy."
"Trump Lawyer Sidney Powell Promises 'Biblical' Lawsuit in Coming Days"
"Guatemalan protesters storm Congress, light building on fire as clashes with government forces escalate"
"Alito Points to Warning Signs That Threaten a Free and Civil Society"
"An Urgent Appeal to WHO: Let Taiwan Speak -- If WHO is serious about the pandemic, it will listen to the nation that successfully confronted it - and stop kowtowing to Beijing."
"BLM Founders Demand Joe Biden Support A 'Roadmap' To Abolition Of Police, Prisons"
"Subway shoving, flamethrowers, shootings in NYC blamed on 'perfect storm' of police reform, pandemic. Shootings have almost doubled from last year following a long era of low crime rates"
"Tennessee Ban On Abortions Due To Down Syndrome, Race, Sex Partially Upheld By Appeals Court"
"Dr. Michael Yeadon, former VP of Pfizer, explains in video why the pandemic is essentially over"
"WaPo Columnist Has an Epic Meltdown Over Republicans Standing By Claims of Voter Fraud"
"Trump Derangement Syndrome in Democrats won't go away with Trump"
"Top 50 Conservative Colleges"
"To Restore Election Integrity, End Mail-In Vote Fraud"
"Seven Letter Poll: 79 Percent of Trump Voters Say Election 'Stolen'"
"Fauci Renews Pandemic For Highly Anticipated Season 2"
"Merkel, Germany's 'eternal' chancellor, marks 15 years in power"
"Remember when: Activists urge Clinton camp to challenge election results in three states"
"Philly Bans All Indoor Gatherings Unless You're Still Counting Biden Votes"
"Trump campaign adviser Steve Cortes: Sudden Stop In Mail-In Vote Count 'Suspicious' -- Particularly since it was followed by a \"deluge\" of votes for Joe Biden in key battleground states."
"Oregon Gov. Brown says people should call the police on their neighbors if they see COVID restriction violations"
"Trump Team Files for Fresh Recount in Georgia's Presidential Race"
"CNN Condemns Trump Rallies As 'Physically Peaceful But Morally Violent'"
"Florida Holocaust museum opens exhibition about George Floyd"
"Dominion responds to Trump team claims"
"Biden secretary of state pick Blinken criticized over Iraq War, consulting work"
"Leftists Hate on Free Speech Platforms GAB and Parler: Where is this Going?"
"Man spits on hikers for not wearing a mask"
"Inside the Fight to Abolish Police in Philadelphia"
"McEnany: We Have To Take Election To The Supreme Court To Expose \"Systemic Voter Fraud\""
"Official How-To Guide for Safely Celebrating Thanksgiving in 2020. By following our guide, readers can comfortably socialize with their friends and family instead of living in isolation from their loved ones because of a virus with a 99.997% survival rate."
"Sisolak limits gathering sizes for restaurants to 25% and require reservations to bars that serve food."
"Nicolas Sarkozy, former President of France goes to trial on charges of corruption"
"GOP senator says Trump to Biden transition should begin 'tomorrow morning'"
"HBO's John Oliver Called It 'Completely Insane' to Use Electronic Voting Machines in Nov. 2019"
"Marsha Blackburn: Big Tech Censorship 'Choosing Winners And Losers'"
"Madeline Grant: UK hasn't had a pro-liberty PM since Thatcher"
"China Issues Instructions for 'Incoming Biden Administration'"
"Polish Prime Minister: EU 'Oligarchy' Wielding 'Propaganda Bludgeon' Like Former Communist Regime"
"Sacramento Sheriff on Not Enforcing COVID Curfew: Making Cops 'Instruments' of 'Oppression' Damages Community Relations"
"Ilhan Omar Urges Biden to 'Reverse' President Trump's Middle East Agreements -- Thinks that peace between Israel and Arab nations is a bad thing."
"All Republicans should support President Trump's legal fights -- Any who believe that buddying up to the Biden team is a symbol of unity, and better for America, have already abandoned Trump, conservatism, and America."
"Poll shows Republican favorability of Fox News has dropped after Election Day"
"Latest: Why a Federal Judge Tossed Out One of the Trump Campaign's PA Lawsuits"
"An statement from Senator Toomey regarding the Pennyslvania Federal Court decision regarding the Trump campaign lawsuit."
"Trump Lawyer: Michigan Legislature Agrees to Hold Election Review Hearings"
"U.S. retailer Guitar Center files for bankruptcy"
"NY company makes window stickers of Cuomo watching over your Thanksgiving"
"Judge Dismisses Trump Campaign Suit to Invalidate PA Election Certification With Prejudice"
"Chris Christie Waddles to Lead the SurrenderCon Pack"
"Coronavirus updates: Los Angeles County closes in-person dining; 20M could get vaccine in December; CDC warns against cruise ships"
"US Exits Open Skies Treaty, Moves to Discard Observation Planes"
"NY Business Owners Kick Out Health Dept, Sheriffs: 'Civil Disobedience Starts Now'"
"Chinese Warn Against Communism at Trump Rally, Tell Americans to Speak Out"
"Waffle House's Stand Against Lockdowns Is Exactly What America Needs-Almost | \"None of the people who make the decisions to shut down businesses and impact people's livelihoods ever have their own livelihood impacted,\" the Waffle House CEO recently told Business Insider."
"US seeks right to bomb Kenya as Islamic terrorists spread"
"Apple lobbying against Uighur Forced Labor Prevention Act: Report"
"Dominic Lawson: The UK practices eugenics (on Down's Syndrome)"
"Scranton dedicates 'Joe Biden Way' to honor president-elect"
"Ohio Shifts Red: Analysts Believe Buckeye State No Longer Swing State"
"Hispanic Voters In Florida Who Fled Dictatorships Think The Election Was Stolen From Trump"
"Conservative Activist on Georgia's Second Recount: The Most Important Part Is Matching Signatures"
"Michigan Canvass Board Member: 'Need Evidence' to Delay Certification"
"There's a way to fix the $4.6 trillion U.S. public pensions mess - Canada shows us how"
"Britons who test negative for Covid set to receive a 'freedom pass'"
"Washington Post publishes and retracts headline: \"Washington's aristocracy hopes a Biden presidency will make schmoozing great again.\""
"Illinois Voter: \"You Don't 'Install' a President, You Elect a President\""
"Pennsylvania election: Trump appeals dismissal of bid to block vote certification"
"Prohibition in Pennsylvania: Governor halts alcohol sales day before Thanksgiving"
"Data: Trump's Anti-Globalism, Pro-Police Message Wins Over Hispanics"
"Watergate reporter Carl Bernstein lists 21 GOP senators"
"The Death Star Strategy: Is Trump Contemplating The Ultimate Constitutional Trick Shot?"
"Hours After Biden Picks Blinken For Secretary Of State - His Closet Door Swings Open On Iraq And Consulting"
"These NHS Staff Were Told The Rushed Swine Flu Vaccine Was Safe, And Now They're Suffering The Consequences"
"Do Trump Supporters Live in an Alternate Universe?"
"Joseph Stalin To Receive International Emmy For His Outstanding Hunger Relief Efforts"
"\"Kracken\" is a ClA Hacking Program"
"REVEALED: Dominion/Smartmatic 'Noncompete' Agreement Emerges Despite Claims of Being 'Fierce Competitors'"
"2008 FlashBack: CNN Says Obama Won His Senate Primary by Tossing Ballots Without Matching Signatures"
"Huntington Beach protests California's coronavirus curfew"
"OUT: I Am Strong, I Am Invincible. IN: Boys Have Cooties! - Duke sorority council bans events with male groups."
"Texan Matthew McConaughey Considering Political Run - He's Looking To Jump Straight To The Top As Governor"
"Virginia Voter Fraud Analysis"
"Emma Hogan: In an age of uncertainty, the 1980s look defiant"
"Bloomberg editorial: Canceling student loan debt is a bad idea"
"Appeals Court Grants Expedited Review of Trump Campaign's Pennsylvania Lawsuit"
"Illinois removes thousands of available hospital beds from state COVID-19 database"
"Ross Clark: (UK) This is the next phase of a ruinous cycle of illogical restrictions"
"Shelby Steele: The Inauthenticity Behind Black Lives Matter"
"Joe Nocera: Schools Don't Spread Covid. Teachers' Unions Don't Care."
"John Cleese Accused Of Transphobia After Expressing Support For J.K. Rowling"
"Sidney Powell: 'Biblical' Lawsuit Coming, Accuses Ga. Gov. Kemp of Deal With Dominion"
"Study: Canceling Student Loan Debts Won't Significantly Stimulate Economy"
"Kelly Loeffler quarantining after positive, inconclusive coronavirus tests: campaign"
"Actor Scott Baio threatens to move to Utah to unseat Sen. Mitt Romney after his anti-Trump tweet"
"Charles Moore: The lack of opposition to (UK) Johnson's Green Crusade is a sure sign of trouble"
"Florida might not force you to get a COVID vaccine - but it can. Here's why"
"Pennsylvania Judge Dismisses Trump Campaign's Challenge to Pennsylvania Election Law"
"Trump Lawyer: Michigan Legislature Agrees to Hold Election Review Hearings"
"Ben Carson: Trump Saved My Life After I Got COVID"
"The Antifa Playbook"
"Rep. Nunes Worried Biden Will Shut Down Durham Investigation"
"Republicans fuming after Dominion Voting Systems backs out night before scheduled PA oversight hearing"
"Higher education cartoon of the week \"They pay You?\""
"Gov. Andrew Cuomo to receive Emmy award for his 'leadership' during the pandemic, Twitter goes nuts"
"Eleventh Circuit Enjoins Local Ordinances Barring \"Conversion Therapy\""
"Federal Election Commission Chair: Trump Campaign Has Legitimate Claims of Election Fraud"
"Texas Passes Law Banning Californians From Voting After They Move There"
"U.S. Election: Trump legal team distances itself from lawyer after controversial comments - National | Globalnews.ca"
"Appeals court to review Trump's Pennsylvania case -- Legal team on track with plan to reach Supreme Court"
"DuPont's Shaped Biden's \"Views\" (no experience!) on Business"
"Chinese American Says the Left, Big Tech Reminds Him of Communist China"
"Don't 'Californicate' The Rest Of America"
"Finally America is realizing that Andrew Cuomo is a putz"
"Biden &amp; Corporate Charters: A Radical, Regressive Proposal"
"Help! Pollsters Have Fallen and They Can't Get Up!"
"Taxes are Too High Right Now"
"Trump Orders Hasty Afghanistan, Iraq Drawdowns to Beat Biden Inauguration"
"What the Media Is Hiding About the DHS' Election Security Statement"
"Trump campaign attorney responds to Pennsylvania ruling &amp; they're grateful"
"Here Is The Evidence"
"Trump Warns 'Massive Fraud' to Be Uncovered in Michigan Vote"
"N.Y. Times op-ed admits: Trump was correct, reopen the schools"
"Hunter Biden Arrives At White House Dressed As Turkey In Hopes Of Being Pardoned By Trump"
"Coincidence? Conservatives Won Big, Except in Contested Swing States"
"Christianity and the Future of American Conservatism | Mark Movsesian"
"Georgia counties saw a mail-in ballot rejection rate as high as double digits, but magically all those problems disappeared in November? See the USA county map enclosed w/in the article for pre-November mail-in ballot rejection rates."
"Former Pfizer Chief Science Officer: \"Pandemic is Over\", \"Second Wave\" based On False-Positive Tests"
"NY Business Owners Stand Up To Unconstitutional \"Lockdown\" Orders"
"CA-25 Republican Rep. Mike Garcia Claims Victory; Democrat Christy Smith Cries Foul"
"Who's Afraid of the Common Good?"
"Just a reminder: Obama won his very first election by charging his opponents with election fraud. Oh, you didn't know?"
"Obama Talks and Talks and Talks About His Memoir and His Greatness. -- The Former President is fixated on \"truth\"-something that mattered very little to him during his presidency."
"Victory! Tennessee Court of Appeals upholds law banning abortions for Down syndrome"
"Poll: Americans Want Biden to Stay Out of Trump Investigations &amp; Pass on Progressive Policies for Now"
"Why not 'My Fuhrer'? Appeals court grills public college on forcing professor to call male student 'miss'"
"Donald Trump Improved Standing With Latinos In 78 Of America's 100 Majority-Hispanic Counties"
"G20 Leaders Move To Distribute Covid Vaccines Fairly"
"Dutch doctors allowed to sedate euthanasia patients before their death"
"Philly Bans All Indoor Gatherings Unless You're Still Counting Biden Votes"
"What Makes Internet Trolls Tick?"
"Political Lists and Facsisn: The Lincoln Project Terrorizes the Opposition"
"After 2,600 Uncounted Votes Turn Up In Georgia - The Chief Elections Clerk Finds A Pink Slip Waiting For Him"
"Effort to recall Calif. Gov. Gavin Newsom granted 120 day extension to March 17 | One America News Network"
"Million MAGA March: Unravelling a Violent Viral Video"
"Why Fewer People Should Go to College"
"If We Want People To Accept A COVID-19 Vaccine, We Should Stop Lying To Them About The Disease"
"U.K. to use AI tool to process 'high volume' of expected adverse reactions from COVID vaccine"
"Dems Threatened Govt Official, Her Family And Pets in Order to Obtain Govt Transition Funds for Biden"
"Trump camp's lawsuit struck down in Pennsylvania"
"Author Abigail Shrier faces threats after warning teen trans epidemic"
"Democrats plan to bring back earmarks. Ready the pork barrel!"
"Sacramento Sheriff on Not Enforcing COVID Curfew: Making Cops 'Instruments' of 'Oppression' Damages Community Relations"
"Pa. Senator Pat Toomey Says President Trump Has 'Exhausted All Plausible Legal Options'"
"Judge Dismisses Trump Campaign's Pennsylvania Lawsuit, Slams 'Strained' Reasoning; This only helps these cases reach higher levels of court because signed affidavits are admissible in court"
"Recall California Governor Gavin Newsom (2020)"
"FLASHBACK: Experts Urge Clinton Campaign to Challenge Election Results in 3 Swing States (2016 claims of vote manipulation and hacking)"
"John Cleese, under fire from woke mob, hopes they all 'fry in their own sanctimoniousness and narcissistic posturing'"
"Oregon Gov: People Should Report Neighbors' Thanksgiving Gatherings With Too Many People"
"Pennsylvania Certifies Nov. 3 Election Results, Gov. Wolf Says"
"Chinese Government Lays Off Entire Propaganda Team As American Media Doing Their Job For Them"
"Congress Just Got Swept By A Red Wave - Out Of 27 'Toss-Up' House Races, The Republicans Took All Of Them"
"Sidney Powell Keeps Telling Kids Their Christmas Presents Are Going To Make Their 'Freaking Heads Explode'"
"Journalist says Gavin Newsom's COVID-snubbing dinner party was far worse than reported: Attendees now 'privately laughing' at controversy'"
"State Governor Frees All Drug Dealers To Provide Prison Space For Families Celebrating Thanksgiving"
"Fifth Circuit Permits Texas and Louisiana to Defund Planned Parenthood"
"Feinstein drops out of Democratic leadership in Senate"
"Biden's win in Nevada certified by Nevada Supreme Court"
"OANN suspended from YouTube for 'misinformation'"
"Michigan County Board Approves Resolution to Impeach Gov. Whitmer - Truly Times - Conservative News"
"FBI Buried Hunter Biden Laptop: It's unlikely there was ever any investigation at all."
"California Pastor Temporarily Turns His Chapel Into a Strip Club to be Deemed \"Essential\""
"Nolte: Only 3% of Trump Voters Believe Joe Biden Is Legitimate Winner"
"Rand Paul says the 'vast majority' of voting must be in person to mitigate potential for fraud"
"Virginia Study: Remote Learning Damaging Students' Education"
"US can kill its own citizens without review when state secrets are involved, DOJ lawyer argues"
"Pope Francis backs George Floyd protests, slams COVID-19 skeptics in book"
"CNN's serious journalist Bryan Stelter says conservatives joining Twitter alternative, Parler, is a \"threat to Democracy\""
"Mitt Romney Should Be Getting Nervous - His Senate Seat Could Be Challenged By Conservative Actor Scott Baio"
"Group files emergency petition in Wisconsin after finding 150,000 potentially fraudulent ballots"
"After Fending Off Pandemic Challenger, Planned Parenthood Retains Title For Most Americans Killed In 2020"
"Some college students plan to 'educate' conservative family members about their political, social views over Thanksgiving"
"McConnell Pushing Forward, Relentlessly Confirming Judges"
"Republican Sen. Perdue says he would fly AOC to Georgia to campaign for his Democratic opponent."
"Hours After Gov. Newsom Enacts California Order - 'Curfew Crashers' In 16 Cities Flood The Golden StateStreets"
"Gov. Cuomo Cancels Thanksgiving with His 89-Year-Old Mother After Backlash"
"WALSH: New HBO Documentary On 'Transkids' Accidentally Tells Disturbing Truth"
"In Seattle, 34 more officers ditch the force as city slashes police budget for a second time"
"Feinstein to Step Down as Ranking Judiciary Dem after Progressive Disappointment with Barrett Hearings"
"Just Hours After Being Placed In Cuomo's Possession, Emmy Statue Dies Of COVID. \"The Emmy was placed in a nursing home for safekeeping and almost immediately contracted the virus, passing away just hours later\""
"Trump Administration To Start Transition Process For Biden"
"Twitter decided to censor posts that 'could undermine faith' in election process before a single vote was cast on election day"
"New Arkansas bill to criminalize nearly all forms of abortions"
"Maxine Waters Pushes for Investigation of 'Criminal' Trump To 'Send a Message Across the World'"
"Federal Appeals Court: Texas, Louisiana Can End Planned Parenthood Funding"
"Why Does Gov. Andrew Cuomo Continue To Single Out Jews?"
"Pennsylvania, Arizona and Michigan state leglislatures to hold hearings on 2020 election"
"'No Masks, All Indoors': Award-Winning Journalist Claims 22 People Attended Newsom Dinner, Not 12, $15k Bar Bill"
"Rashida Tlaib accused of anti-Semitism for reaction to Biden's Jewish Sec of State nominee"
"Rush Limbaugh criticizes Trump legal team for promising 'bombshells' and failing to deliver"
"Trump vows he'll 'never concede' despite administration starting transition move"
"Election fraud to any degree destroys trust"
"Joseph Nye: \"Trump deserves credit for pushing back on China's abusive trade practices, but it would have been better if we worked with our allies to isolate China. Also, his trade deal has been costly for Americans without changing the trade imbalance or addressing technological issues.\""
"Pushed Out? Feinstein Stepping Down As Lead Democrat On Judiciary Committee Following Left-Wing Criticism"
"Trump campaign continues to fight as more evidence of voter fraud emerges"
"Post-George Floyd, a Wave of 'Anti-Racist' Teaching Sweeps K-12 Schools Targeting 'Whiteness'"
"Psychologist And Search Engine Expert Robert Epstein: Google Shifted a 'Minimum' of 6 Million Votes in 2020"
"FNC's Laura Ingraham: 'I Would Be Lying to You' if I Said There Was an 'Excellent' Chance SCOTUS Delivers Victory to Trump"
"Tlaib denounces Pompeo's decision to recognize BDS as antisemitic"
"Alleged Money Trail from China to Georgia Hints at Rigged Results and Certification Flip-Flops"
"Get ready for major backlash to the next wave of lockdowns. As public-health experts have largely jettisoned any claim to public trust."
"Thousands in Georgia Registered at Postal, Commercial Addresses, Portraying Them as Residences, Researcher Says"
"Trump lawsuit confuses Michigan and Minnesota locations in affidavit claiming voter fraud"
"Pennsylvania, Nevada certify election results for Biden despite Trump legal challenges"
"Rush Limbaugh On Trump's Legal Team: 'They Promised Blockbuster Stuff And Then Nothing Happened'"
"Lord Acton on the enduring significance of the American Revolution"
"Walmart Thanks Government For Completely Obliterating Their Small Business Competition"
"Oregon Imposes 30 Days In Jail For Thanksgiving Gatherings"
"After joining Burisma, Hunter Biden requested meetings with Antony Blinken, Biden's Pick for Secretary of State"
"Dominion Executive: Trump is not going to win. I made f***ing sure of that."
"AOC and Ted Cruz clash over stalled COVID-19 relief bill"
"All SUNY Students Must Test Negative for COVID Before Thanksgiving Break: Chancellor"
"When It Comes to Election Fraud, It's 'Hear No Evil, See No Evil, Speak No Evil'"
"Republicans should make AOC House Speaker | Spectator USA"
"John Brennan's breathless &amp;amp; dramatic thread bidding farewell to the president is met with calls for Trump to 'declassify everything'"
"New Congresswoman Creates a Furor by Asking About Her Second Amendment Rights"
"Michigan's State Board of Canvassers votes to certify election"
"Tennessee Democrat Jim Cooper Attacks People With Down Syndrome To Mock Republican Voters"
"Where are the Republican Politicians? Have they Deserted Trump?"
"Maryland GOP Gov. Hogan: 'No Constitutional Right To Walk Around Without A Mask' (Video)"
"Patrick Byrne of Overstock: This election was rigged - deeply"
"Walmart Thanks Government For Completely Obliterating Their Small Business Competition"
"New Virginia study finds online schooling is severely damaging students' academic achievement"
"Black Republican Opponent Expected to Defeat Stockton's Popular Democratic Mayor Michael Tubbs"
"Hawley 2024? Missouri Republican could be 'Trump 2.0,' say conservative supporters"
"Edward Solomon reverse-engineered the Dominion Voting Algorithm"
"Seattle: Another 34 police officers leave as downtown businesses report an increase in crime"
"Strategic Disinformation and the 2020 Election -- The intelligence community is no longer prepared to defend America against foreign deception and disinformation."
"Woke media outlet tries to make a funny video about white stereotypes and it's the most racist thing you'll watch today"
"US Drafts List of 89 China Firms With Military Ties"
"Brits Who Test Negative For Covid-19 Could Get 'Freedom Pass' To Avoid Restrictions"
"Democrat Governors are Suicidal -- or They Don't Believe in Their Own Lockdowns"
"Mattis says he hopes Joe Biden takes 'America First' out of national security strategy"
"It doesn't end with COVID. Matt Hancock in the UK wants to use NHS testing system to fight flu after Covid."
"Andrew Cuomo Absolutely Deserves An Emmy Award -- Cuomo is America's greatest governor on television--and its worst in real life."
"Are the Republicans Writing Their Own Political Obituaries? Having your win stolen blatantly and yet concede it without a fight is not a sign of the moral high ground. Instead, it is a death sentence to your political future."
"Errors, 'Scams' Led California To Send Millions In COVID Unemployment Benefits To Prisoners, Death Row Inmates"
"Lone Michigan Canvasser Holdout: 'Whoever Threatens the Most Wins'"
"Cammack: 'Only in America' Could I Go from Homelessness to Congress"
"The Fourth Estate: Andrea Mitchell reports that a Biden administration isn't going to be political"
"Stephen Moore: \"Paris Climate Treaty Puts America Last\""
"Group Files Emergency Petition in Wisconsin After Identifying 150,000 Potentially Fraudulent Ballots"
"James Mattis: Joe Biden Must 'Eliminate \"America First\"' from U.S. Foreign Policy"
"Americans Across the Nation Are Rising Up Against Draconian Lockdowns"
"The Coming Anti-COVID Restriction Backlash"
"To Avoid Thanksgiving Restrictions, Family Having Several \"Clumps of Cells\" Over Instead"
"Pro-Trump Attorney Lin Wood Urges Republicans Not To Vote In Georgia Senate Runoff -- Unless GOP candidates help overturn the presidential election results in the state."
"Poll: One In Six Biden Voters Would Have Changed Their Vote If They Had Known About Scandals Suppressed By Media"
"PA's Thanksgiving liquor sales mandate is just bizarre"
"This would literally kill me"
"Chris Evans, Zach Braff Want A List Of 'Trump Enablers'"
"Biden's Pick For National Security Adviser Is A Steele Dossier Truther"
"Democratic Member Seeks To Disbar Two Dozen Lawyers Challenging Election Results"
"Breaking: Founder of Overstock.com 100% confident that election was rigged and can prove it forensically through code.."
"Media on All Out Assault on Governor Noem as she refuses to issue mask mandate"
"Allison Pearson: Leftists who dominate our institutions get to define what constitutes offensive behaviour, then they come up with a new 'ism'"
"Michigan board certifies Nov. 3 election results as one GOP canvasser dissents"
"3rd major COVID-19 vaccine shown to be effective and cheaper"
"Hunter Biden Arrives At White House Dressed As Turkey In Hopes Of Being Pardoned By Trump"
"CDC talks about COVID Camps"
"War has and is being waged principally against our culture -- against our values, beliefs, and mores. It has been and is against the fundamentals of a healthy society. The assaults are against what's organic to a vital society: marriage, family, and children, neighborhood and community."
"After Trans Activists Try To Ban The Book 'Irreversible Damage,' It Becomes A Bestseller -- Trans activists keep bullying businesses into removing content through fear tactics rather than by countering the message with their own better one."
"Dan Bongino hints at potential run for president in 2024 if Larry Hogan runs and no Trump does"
"Ohio lawmakers say elective medical procedures could be postponed amid 'exponential' surge in COVID-19 cases"
"Rubio derides Biden's foreign policy team: 'Polite and orderly caretakers of America's decline'"
"Pope Francis book backs George Floyd protests, blasts virus skeptics"
"Biden's Gun-Registration Scheme Would Cost Firearm Owners Billions - If It Passed Congress and Americans Complied"
"Gov. Cuomo floats hosting his elderly mom for Thanksgiving, sparks uproar"
"Oregon Governor: Snitch On Your Neighbors For Violating Thanksgiving COVID Orders"
"Border Security is Crucial for National Security"
"BLM pressures Democrats to embrace bill described as 'roadmap for prison abolition'"
"Cooper's Office Now Claims He Meant To Say All Republicans Are Racist, Not Mentally Disabled"
"Republican Maryland governor says no one has a 'constitutional right to walk around without a mask'"
"Harvard creating new 'antiracism' librarian job. It pays up to $240,300 per year."
"Pompeo Predicts 'Many' More Mideast Peace Deals: 'We Broke Glass'"
"Trump Won't Budge From Veto Threat Over Renaming Bases Honoring Confederates"
"Republican Maryland governor says no one has a 'constitutional right to walk around without a mask'"
"White Anti-Racism Author Robin DiAngelo Paid More Than Black Woman To Speak At Same Diversity Forum"
"Martin Wolf: What the world can learn from the Covid-19 pandemic"
"Wauwatosa Mayor: \"Guns have no place in shopping malls or other places in which crowds of people gather. Mayfair has a strict no-gun policy. If the shooter had complied with that policy, no one would have been hurt yesterday.\""
"Holocaust Museum In Florida Sparks Outrage After Adding George Floyd Exhibit"
"Gavin Newsom Alerted To Illegal Activity By The Sound Of Children's Laughter"
"Gov. Andrew Cuomo Calls Sheriffs Who Won't Enforce His Thanksgiving Restrictions Dictators"
"Swiss Doctors Asking Vulnerable To Sign 'Do Not Resuscitate' Orders"
"Stacey Abrams: 'More than 750,000' Georgians Requested Ballots for Runoff"
"AOC suggests criticizing socialism is racist after reeling Dem colleagues blast radicalism"
"Raphael Warnock reportedly said racism is America's 'pre-existing condition'"
"Justin Haskins: Democratic socialists grow stronger, weakening Dems with losses in swing districts"
"Why Philly Gym Owners Are Protesting Un-Real New Regulations"
"Rand Paul: No DOJ Investigation into Funding Behind 'The Thugs' Who Attacked Republicans After RNC Event in August"
"International Flyers May Soon Need to Get Virus Vaccinations"
"One in four Rhode Islanders can't meet basic food needs, food bank's annual report says"
"Pentagon Report: China Now Has World's Largest Navy as Beijing Expands Military Influence - USNI News"
"Mueller Probe's Andrew Weissmann Wants Biden DOJ to Prosecute Trump"
"The Biden Popular Front Is Doomed to Unravel"
"Maryland Gov. Larry Hogan expands coronavirus snitch line: 'There's no constitutional right' to go maskless"
"Google Plots to Use the Biden Administration to Avoid Accountability"
"The Great Relocation: Americans Are Relocating By The Millions Because They Can Feel What Is Coming"
"SCOTUS issues new circuit assignments - 'justices can opt to bring cases from their circuit straight to the Supreme Court.'"
"U.S newspapers got paid millions to publish Chinese propaganda"
"Do Trump-Supporters Live in an Alternate Universe? Actually a huge number of Americans have a false impression of reality because they are being told lies by their media. The people who constantly hear these lies do live in an \"alternate reality.\""
"Bombshell: Biden takes min 98% of a 23,487 vote batch at 12:18AM in GA"
"The Corona Virus Pandemic, an Analysis: Part 1 By Dr. Roger Hodkinson (this is the Canadian pathologist who went off in a public health meeting a little while ago)"
"Nearly 40 Shot Friday into Sunday Morning in Lightfoot's Chicago"
"Ballots cast by the dead emerge in extremely tight Brindisi-Tenney race"
"Climate Change Alarmist Harrison Ford Seen Landing Private Jet to Pick Up Son Ahead of Thanksgiving"
"The Skyrocketing National Debt is Highly Problematic"
"Poll Shows Media Censorship Cheated Voters of Vital Info, Robbed Trump of Second Term"
"Trump Administration Begins Transition Process"
"'It Will Be Epic': Sidney Powell Releases Another Statement After Lawyers Say She's Not On Team"
"How to Start Curbing Violent Crime by Lt Col Jeff Cooper"
"Trump: Voters are '100% correct' that 2020 'election was stolen' -- Jenna Ellis: 'Media chatter of Joe Biden picking his cabinet is like fantasy football'"
"Bill Gates Smears Parler and its Users"
"Joseph Ladapo: Too Much Caution Is Killing Covid Patients"
"Melanie Phillips: Covid cronyism shows state machine is broken"
"JUST IN: Third Circuit Court of Appeals Grants Expedited Review For Team Trump's Appeal in Pennsylvania"
"Trump campaign takes Pennsylvania election fight to federal appeals court"
"Good ol' progressive liberals pushing for segregation in college universities."
"Sidney Powell Confirms Non-Affiliation With Trump Legal Team, Vows to Continue Fraud Fight"
"Police Union Tells Embattled New York Subway Riders 'You're on Your Own' amid the recent rash of shoving incidents by unhinged assailants"
"'You're Such A D**k': New Jersey Gov Confronted Eating Maskless Outside With His Family"
"Dow Jones Surpasses 30,000 for the First Time"
"Trump scores two wins as Michigan legislature, federal appeals court agree to election reviews"
"George Takei: 'I Want to Live in a Country Where Kaepernick is Seen as a Hero and Kyle Rittenhouse Is Seen as a Terrorist'"
"AOC Suggests Criticizing Socialism Is Racist After Reeling Dem Colleagues Blast Radicalism"
"Women and girls are about to be portrayed in textbooks a lot differently"
"Media Unveils Bold New Plan to Win Latino Support by Calling Them Racist"
"Rudy Giuliani on Break with Sidney Powell: 'We're Pursuing Two Different Theories'"
"A Neighbor You Like Probably Voted For Trump"
"Sidney Powell Responds to Trump Campaign's Statement Saying She's Not Part of Legal Team -- Powell said her fight will go on anyway and closed her statement with the hashtag, \"#KrakenOnSteroids\""
"On Coronavirus, We Must Not Allow Politics to Dictate Science - The New American"
"Gov. Cuomo Calls Police Who Refuse to Enforce His Insane Orders \"Dictators\""
"Fury Erupts as George Floyd Exhibit Opens at Holocaust Museum"
"Risk v. Profit: Uncle Sam needs a better way to budget for federal lending."
"After Fending Off Pandemic Challenger, Planned Parenthood Retains Title For Most Americans Killed In 2020"
"Two-thirds of GOP voters support Trump running for president in 2024: survey"
"Dominion CEO Admits In Testimony This Year to Congress: Machines Rely On Chinese Parts From 'Screen Interface Down To Chip Level'"
"In Canada, you have to show ID and proof of address to vote in Federal elections"
"Redfield projects COVID-19 vaccine to be rolled out by 'end of the second week in December'"
"Pennsylvania bans alcohol sales at bars, restaurants on Thanksgiving Eve as COVID cases climb"
"In Apparent Glitch, Voting Machines Hunt Down And Murder Trump Supporters"
"AOC calls out Kyle Rittenhouse's $2 million bail release as 'protection of white supremacy'"
"Trump campaign says Sidney Powell not a member of legal team"
"Beijing-Controlled News Outlet Paid US Newspapers Millions To Publish Propaganda This Year"
"Why The Left Can Be So Ridiculously Self-Righteous Without Realizing It -- What we saw in the lead up to the elections, and what we'll witness for years to come, is utter contempt for Trump voters and conservatives in general."
"Sen. Feinstein to Step Down from Judiciary Committee After Backlash from Progressives"
"If the 2020 Election Was Held in a Foreign Country, the State Department and Western Media Would Declare it \"Fraudulent\" -"
"Calls for Britain to give asylum to Pakistani Christian girl forced to marry Muslim man who abducted and gang-raped her"
"Covid-19: China pushes for QR code based global travel system"
"Majority say they want GOP in control of Senate: poll"
"Watergate journalist Carl Bernstein outs 21 Republican senators who 'privately' expressed 'extreme contempt' for Trump."
"Journalist Carl Bernstein names 21 GOP senators who 'privately expressed their disdain' for Trump"
"Appeals Court Grants Expedited Review of Trump Campaign's Pennsylvania Lawsuit"
"The new silent majority, watch democrats raise the voting age to 90+"
"ICYMI: Diebold, the company accused of rigging the 2004 election for Bush, was bought out by Dominion in 2010."
"Trump Tells GSA, and His Team, to Begin the Transition Process; Vows to 'Keep Up the Good Fight'"
"Trump's election lawsuit leads to 3rd Circuit grant for expedited review"
"What Gavin Newsom's Inevitable Political Doom Means for Democrats - American Greatness"
"Democrat House Losses Stemmed From Trump Increasing Voter Turnout: Rep. Richmond"
"The Thieves Who Stole Our Election Got Sloppy"
"'Burn It Down' -- Activists in Seattle want to abolish police, prisons, and courts."
"Rudy Giuliani Explains Why He Distanced Himself From Sidney Powell"
"Progressives Declare War on Asians, Meritocracy and STEM - Asian Dawn"
"Rush Limbaugh: Trump Needs to Hold Rallies in Georgia"
"Janet Yellen Is Biden's Pick for Treasury Secretary"
"Biden proposes John Poulos, CEO and President of Dominion Voting Systems, as Surgeon General and Head of Covid Analytics. Dominion will now be solely in charge of recording and keeping an exact count of what has become the most deadly virus in the history of the world."
"Even social media sites tried to block links to the news."
"'Malevolent travelers' coming if Trump's travel ban killed -- Biden has promised to eliminate executive order on 'Day 1'"
"HISTORIC: Netanyahu Meets Saudi Prince in Saudi Arabia, Reports Say"
"Victor Davis Hanson: A Time of Chaos Upon Chaos Atop Chaos -- There is a series of battles to come in January 2021, in 2022, and in 2024 that will be definitive, if the chaos of 2020 does not become even more chaotic."
"Another Democratic Governor Shuts Down State, Orders Masks Indoors And Outdoors"
"Narcissists love being pandemic essential workers They post more about work on social media, feel more important (probably the epidemiologists and pathologists as well)"
"Political Enemy List Trump Accountability Project Publicly Posted on Their Website"
"Where American Workers Donated This Presidential Election"
"President Trump won?"
"In threat to Iran, US sends heavy bombers to Middle East via Israel"
"Biden's Treasury Secretary: Janet Yellen"
"University System Mandates 140,000 Students Test Negative For COVID-19 Before They Can Leave For Thanksgiving"
"Protesters take to the streets in California to bash Newsom's curfew orders"
"Cooperate with China or World War 3: Kissinger"
"Antiracism Icon Robin DiAngelo Paid More Than Black Woman for Same Job"
"Man Catches Flu, Dies, From Eating Outside In The Cold To Avoid Getting COVID-19 (satire)"
"The 2005 Carter-Baker Report Predicted Election Madness 15 Years Ago"
"Trump Pulls Out Of Military Transparency Treaty With Russia, Europe"
"Annoyed ABC Scolds Americans 'Not Listening,' Visiting Family on Thanksgiving"
"George Soros-linked election software company lies about ties with Dominion | One America News Network"
"GOP Former National Security Officials Urge Party to Demand Trump Concession"
"5 More Ways Joe Biden Magically Outperformed Election Norms"
"America Needs A Special Counsel To Investigate Election Integrity, Stat -- With credible allegations of fraud compounding by the day, the American people deserve a special counsel investigation to set the record straight."
"Union Bosses Sink Bernie Sanders as Labor Secretary"
"Pennsylvania Bans Sale Of Alcohol At Bars, Restaurants Ahead Of Thanksgiving"
"CNN Drowned Out by Protesters Chanting 'CNN Sucks! CNN Sucks!'"
"Business Owners March Against Governor Murphy's Executive Orders"
"Trump Tells GSA, and His Team, to Begin the Transition Process; Vows to 'Keep Up the Good Fight'"
"Liberals' race rhetoric is a power grab"
"Propaganda, Election Fraud and the Death of Journalism"
"Viral Video: NJ Gov. Phil Murphy Confronted At Restaurant For Not Wearing Mask"
"Israel's Netanyahu, Saudi Crown Prince Hold First Known Meeting"
"Portman: No proof of mass fraud that would change election result"
"Qantas Airlines First to Require COVID Vaccine for International Flyers: 'That's a Necessity'"
"Trump's legal team's statement on Sydney Powell was made to focus on the upcoming Supreme Court case. There are two separate legal pathways. One on equal protection and PA voting rules (most important right now). The second is Dominion software which will take longer."
"5 More Ways Joe Biden Magically Outperformed Election Norms"
"Georgia extends use of absentee ballot drop boxes for Jan. 5 runoff amid surge in requests"
"Lou Dobbs Warns the GOP: Republican Party 'Will Be Gone and Done' If They Don't Stand With President Trump"
"Late Justice Scalia's son blasts Harris for insinuating Catholic charity a hate group"
"WHO Director Dr. Tedros Moves the COVID-19 Goalposts Right Off the Playing Field. He wants you to know that vaccines won't really change anything in response to COVID-19. His statement defies the management of any virus and there is no science to support it."
"COVID-19 vaccines could be required for certain jobs"
"'You Can't Enforce' Thanksgiving Lockdowns, New Mexico Governor Says"
"Peer-reviewed hydroxychloroquine study finds 84% fewer hospitalizations among early treated outpatients"
"Newsom pressured to pick 'woman of color' to fill Senate seat. Former San Francisco Mayor Willie Brown is pushing Maxine Waters among others."
"Secretary of state pick Antony Blinken met twice with Hunter Biden"
"Florida Holocaust Museum sparks fury by adding George Floyd exhibit"
"China now blaming Italy for starting Wuhan coronavirus pandemic"
"Joel Kotkin: The Green End Game Runs Through Biden"
"Judge Denies Injunction for 'Black Only Relief Fund'"
"Expunging an electoral stain: U.S. voting must re-establish pre-pandemic integrity"
"Sidney Powell responds after Trump campaign says she is not part of legal team: '#KrakenOnSteroids'"
"Computer Repair Shop Involved in Hunter Biden Laptop Scandal Shuttered"
"Open Letter Calls on Harvard to Create 'System of Accountability' for Inviting Trump Admin Alums to Campus"
"Viral video shows New York business owners take defiant stand when health inspector barges inside: 'Go get a warrant'"
"Trump obsession: Democrats tweet about him 12,569 times to 486 about Biden"
"Vaccine tracking"
"\"Georgia Is the First State I'm Going to Blow Up and Mr. Kemp and the Secretary of State Need to Go With It!\" - Sidney Powell"
"'WJ Live': The Viral Memo Changing the Trump Legal Strategy"
"AOC Blames Republicans for Democrats Delaying Additional COVID Relief"
"RNC Chair: Democrats used COVID to remove election safeguards"
"From revolution to restoration: Biden picks Blinken, Yellen, Kerry for plum posts"
"USA Election 2020 Was Rigged: The Evidence - Patrick Byrne"
"DC bill wants to allow kids to take vaccines without parents"
"On Thanksgiving, Democrats Demand The Ultimate Family Separation Policy -- Life is too short to live it in fear of dying."
"Dick Morris to Newsmax TV: Stats Prove Ballot Stuffing"
"House GOP wins suggests party growth, possible majority in 2022 | One America News Network"
"Putin Says He's Not Ready to Recognize Biden as U.S. President"
"GOP Likely to Gain Third US House Seat in California"
"Civil Disobedience: WATCH Angry business owners RESIST Cuomo's enforcement visit by Health Dept, Sheriff * The Savage Nation"
"Black Lives Matter Wisconsin leader - a convicted felon - arrested on suspicion of sexual assault"
"Election Aftermath: Either Or -- It is down to an \"either or\" situation: either President Trump prevails in his lawsuits and multiple constitutional paths to reelection, or Joe Biden and the Democrats succeed in stealing the election."
"After Pelosi Claims She Wants To Provide Relief - Records Show 40 Times The House Democrats Blocked Relief Aid"
"HBO talkshow host Bill Maher slams Democrats for hypocrisy on COVID-19 protocol -- 'They keep getting caught doing what we're not allowed to do.'"
"Get Ready Millennial's; You're About To Be Sorely Disappointed with Your Vote"
"'Call of Duty: Black Ops Cold War' Affirms a Pro-American Worldview -- A rich gaming environment replete with Reagan administration cameos is just what the doctor ordered."
"Left-Wing Activist And Actress Alyssa Milano Warned Against Electronic Voting Machines in 2018: 'We Need Paper Ballots'"
"California School District Bans Use of Classic Books in Classroom Over Racism Complaints"
"Patrick Buchanan: \"What Trump Will Leave in Biden's Inbox\""
"Professor causes uproar asking Biden voters to unfriend him"
"WSJ Editorial Board: Stockton, CA elects Republican Mayor vowing safer streets"
"CDC Advises Family Households To Ostracize College Students Returning Home For Thanksgiving"
"New York Democratic Leaders Caught Maskless At Private Party Despite COVID Restrictions"
"How Trump Responded When Liz Cheney Called on Him to Concede: \"Sorry Liz, can't accept the results of an election with hundreds of thousands of fraudulent votes cast, enough to easily flip the Election. You're just unhappy that I'm bringing the troops back home where they belong!\""
"Dominion Voting Systems says it is 'physically impossible' for their machines to switch votes for candidates"
"Michael Flynn: Sidney Powell temporarily suspended from Twitter"
"Trump campaign demands recount, signature matching in Georgia"
"LORD SUMPTION: Wrong for government to tell us what to do at Christmas"
"Biden's Student Loan Bailouts: Bad Economics, A Regressive Tax, And A Moral Hazard"
"Trump Campaign Formally Requests a Recount in Georgia"
"The Latest Memorial to George Floyd Is in a Holocaust Museum"
"Violent crime surges as police funding plummets | One America News Network"
"Statement from Sidney Powell to \"WE THE PEOPLE\""
"Oregon governor backs idea of alerting authorities on neighbors who violate COVID-19 restrictions"
"AOC: Does anyone believe Rittenhouse would be released if he were Muslim &amp; did the same thing in a diff context? For people who say \"systemic racism doesn't exist,\" this is what it looks like: protection of white supremacy baked deep into our carceral systems."
"UK Physician - \"Frankly, if it had not been for mainstream media and the government, I would not have even noticed there were a pandemic. I experienced no excessive dying, and no excessive becoming seriously ill.\""
"Federal judge dismisses Trump campaign's Pennsylvania case"
"Court Rules Tennessee Can Outlaw Down Syndrome, Race, and Gender Abortions"
"Will Republicans Learn From The 2020 Election?"
"In picking John Kerry as his cabinet-level \"climate czar,\" Joe Biden is signaling strong support for Rep. Alexandria Ocasio-Cortez's costly Green New Deal. Rumors are circulating that AOC is being considered for EPA administrator or elsewhere in the administration."
"War and more war coming with Biden's Sec. of State Blinken"
"Dominion VP Explains How to Alter Votes"
"Joe Biden Central-Planning Ambitions Dangerous"
"Patrick Byrne of Overstock has been poring through the data: This election was rigged - deeply << JoNova"
"Ted Cruz Hits AOC for Criticizing Senate Recess. \"AOC seems not to know there are Democrats in the Senate. Or that Joe Biden (also a Dem) is publicly calling on Senate Dems to continue filibustering COVID relief because he thinks it will help them win Georgia.\""
"Latinos in South Texas Voted Against Illegal Immigration and CBP Demonization"
"Banks Give Black-Owned Businesses Advantage on Supply-Chain Finance Terms. Programs spring from multibillion-dollar commitments banks made to expand lending and investment after Black Lives Matter protests this year"
"Mike Flynn Jr. adds twist to Trump team's statement on Sidney Powell: 'Give this the 24hr rule ...'"
"Sidney Powell Releases Statement"
"The U.S. has withdrawn from the Treaty on Open Skies"
"Will The Supreme Court Defend Religious Liberty From Pandemic Tyrants?"
"Do as I say, not as I do: California's top Democrats display their hypocrisy over COVID-19"
"China Proposes Global 'Track and Trace' System for Travel Reset"
"In Oregon Crack cocaine was legalized in a November 3rd referendum along with all other illicit drugs while plastic straws were prohibited. The Oregon Health Authority however wants people to stay safe and remember to pull your mask back into place between puffs on your crack pipe."
"Eyes rolling so hard that I can see the back of my skull. I guess pollution is racist now too!"
"Trump 1st President Since Carter Not to Send Troops Into New Conflict"
"Fox News daytime ratings drop by 32% in two weeks since the election"
"'Transhood' Documentary Shows Parents Brainwashing 4-Year-Olds Into Transgenderism -- New HBO documentary depicts parents propagandizing their children in radical gender theory and robbing them of life in their natural bodies."
"BREAKING: Trump pardons former national security adviser Mike Flynn"
"Crowd Erupts in Grasps and Laughter at Vote Anomaly"
"Judge Blocks Certification of Pennsylvania Election Results"
"A 90-Year-Old Woman Killed Herself To Avoid Another COVID-19 Lockdown. She's Not Alone -- In a tragic irony, the prospect of another 'life-saving' lockdown has drained some senior citizens of their will to live. Assisted suicides and depression are up."
"Jack Dorsey: 'Let Me Be Clear: Twitter Is A Platform For ANY And ALL Ideas I Wholeheartedly Agree With'"
"Defiant NY gym owner, US Marine rips up $15,000 fine for violating coronavirus restrictions"
"Audible Gasps and Laughter From Crowd and Panel at PA Hearing When Witness Says Vote \"Spikes\" Went 600,000 For Biden and 3,200 For Trump (VIDEO)"
"BREAKING: Judge Blocks Pennsylvania Certification!!!"
"TESLA CEO, Elon Musk overtakes Bill Gates to become the world's second-richest man after his net worth rose by $100B in a year during pandemic"
"Ballot Chain of Custody Destroyed in Delaware County, PA"
"After warnings to avoid travel, Denver Mayor, Mike Hancock flies to visit family for Thanksgiving"
"Governor Newsom Orders Police To Go Door To Door Arresting Anyone Not Depressed And Alone"
"Huge court win lets Trump present ballot evidence, could overturn Nevada result"
"Trump Tells Supporters to Stand Tall and Proud: 'Don't Be Intimidated'"
"Pennsylvania state judge sides with GOP, halting election certification"
"Obama takes jab at Hispanic voters for supporting Trump."
"Judge Blocks Certification of Pennsylvania Election Results"
"PENNSYLVANIA \"Judge Patricia McCullough ordered the state to not take any further steps to complete the certification of the presidential race... She also blocked the certification of *ALL* the other election results.\""
"Newsmax Calls Biden Winner in Mich., Nevada, Pa. Based on Certifications"
"BREAKING: Trump pardons former national security adviser Mike Flynn"
"And the Emmy for Most Deaths goes to..."
"Days After Pennsylvania Tries To Certify Election - Judge Intervenes For Trump, Blocks Any Further Certification Pending Hearing"
"Black Lives Matter Leader Killed in Carjacking"
"Judge Blocks Certification of Pennsylvania Election Results"
"Gov. Andrew Cuomo blasts NYPD for refusing to enforce Thanksgiving restrictions: Those people aren't real law enforcement officers"
"Huge court win lets Trump present ballot evidence, could overturn Nevada result"
"Penguin Random House staffers broke down in tears over release of Jordan Peterson book: report"
"Huge court win lets Trump present ballot evidence, could overturn Nevada result"
"Barack Obama accuses Republicans of creating 'sense that white males are victims'"
"Keith Olbermann Unhinged - 'We need to turn Trump Hotels into prisons for his supporters'..."
"Pres. Trump pardons Mike Flynn"
"Major LGBT Group Urges Biden to Strip Accreditation of Christian Schools, Colleges"
"Trump announces pardon of former National Security Advisor Michael Flynn"
"Without Evidence, Former President Obama Accuses Hispanic Trump Voters Of Bigotry"
"Rudy Guiliania and Ellis nail it at the legislature voter fraud hearing in Pennsylvania"
"Chinese Government Lays Off Entire Propaganda Team As American Media Doing Their Job For Them"
"New 'Study' Claims 'Far-Right Terrorism' is 'Bigger Threat to West Than Islamic State'"
"President Trump pardons ex-natl security adviser Michael Flynn; ends three-year legal odyssey"
"WATCH: Voter Fraud and Election Meddling Evidence Floods Social Media"
"Trump Addresses Irregularities in Pennsylvania: 'We Won This Election by a Lot'"
"After Lecturing Trump Supporters on Masks, Jon Karl Caught Taking off His Mask Today in WH Press Briefing Room When He Thinks the Cameras Are Off"
"Portland's Black BLM Activists Say They're Done With 'White' Antifa, Want 'Separation'"
"Pittsburgh Judge Halts Further Election Certification Steps"
"Sidney Powell To File Lawsuit Wednesday in Georgia Alleging Massive Voter Fraud"
"Woke media outlet tries to make a funny video about white stereotypes and it's the most racist thing you'll watch today"
"Buildings Lit Up Blood Red to Protest Christian Persecution"
"Only 3% of President Donald Trump voters believe that Joe Biden legitimately won the 2020 election"
"Thousands of \"Votes\" in Georgia Used False Address"
"CNN Credits Biden for Dow Hitting 30,000 for the First Time: AIR.TV"
"Gun-toting Congresswoman-elect Lauren Boebert may carry Glock at Capitol"
"Huge court win lets Trump present ballot evidence, could overturn Nevada result"
"Donald Trump on Mattis' Remarks that \"America First\" Policy Should Be Abandoned: \"That says it all about Mattis. Obama fired him. I should have fired him sooner.\""
"Data scientist slams 'inherently biased' media for glossing over COVID spikes in blue states"
"Trump Pardons Michael Flynn -- 'have a truly fantastic Thanksgiving!' -- Flynn Tweets Jeremiah 1:19: 'they shall fight against thee; but they shall not prevail against thee'"
"We did it': Fox News owner's wife celebrated Biden's projected presidential win in a tweet"
"Obama invites avalanche of criticism with 'condescending' remarks on Hispanic Trump supporters"
"CNN silent as nurse's viral tale of patients denying coronavirus from deathbeds falls apart"
"Appeals Court Rules Texas, Louisiana Can Cut Medicaid Funding to Planned Parenthood"
"Michigan ramps up threats to prosecute vote-fraud WITNESSES"
"Michigan County Commission Backs Gretchen Whitmer Impeachment"
"\"It's a good day for freedom\" - South Dakota's government is not taking the lead in mandating CDC protocols"
"Denver mayor couldn't even wait a whole hour to fly to Mississippi for Thanksgiving after warning people to 'avoid travel, if you can'"
"Black Lives Matter activist who helped lead Louisville marches shot dead"
"ICE says double-murder suspect was protected by California sanctuary city"
"Several employees cried when they learned their company would be publishing Jordan Peterson's new book"
"John Cleese, under fire from woke mob, hopes they all 'fry in their own sanctimoniousness and narcissistic posturing'"
"Now that fascism has been defeated in America, we can finally enforce COVID lockdowns without resistance. Our nation is finally free to lockdown to save ourselves from a virus with a .001% fatality rate."
"Hungary PM Orban denounces George Clooney as a puppet of Soros"
"Dominion Techie Worked For CCP Military Proxy Flagged By U.S. Govt For 'Malicious Cyber Activity'"
"YouTube Bows to Transgender Activists, Deletes Candace Owens Podcast."
"NYC Mayor de Blasio fines synagogue $15K for massive secret wedding, says house of worship will be closed down if there's 'any further illegal activity'"
"Chris Evans, Zach Braff Want A List Of 'Trump Enablers'"
"Staffers Crying Over Jordan Peterson Book Cured By Forcing Them To Read Jordan Peterson Book"
"Thousands in Georgia Used False Address For Voting: Researcher"
"BREAKING: Trump Pardons Former National Security Adviser Michael Flynn"
"Suicide Claimed More Lives in October Than 10 Months of COVID-19 in Japan, Report Shows | Jon Miltimore"
"Forcing The Sick And Elderly To Die Alone Is Crueler Than COVID-19"
"Exit Polls Suggest Little Enthusiasm for Biden among Union Members"
"Depression rate in the United States triples during COVID pandemic, research shows"
"Judge Blocks Certification of Pennsylvania Election Results Until Friday Hearing"
"Alyssa Milano extends 'olive branch to Trump supporters' - and the left-wing, Trump-despising actress gets totally torched"
"BREAKING: Michael Flynn granted full pardon by President Donald Trump"
"Pennsylvania judge halts election certification amid mail-in vote fight"
"President Trump pardons Michael Flynn"
"Judge Blocks Certification of Pennsylvania Election Results"
"Los Angeles County Health Officials Can't Provide Data To Support Their New Outdoor Dining Restrictions"
"Pennsylvania Judge Halts Further Vote Certification Steps"
"Staff of Canadian publishing company reportedly cry over decision to publish Jordan Peterson's new book"
"Joe Biden Recites Alphabet To Prove His Mental State 'strong'"
"Sorry Media, Trump Is Still President And This Is Still His Stock Market"
"Trump pardons his former National Security Adviser Michael Flynn"
"GOP Chair Christiana asks DA to review mail-in ballot envelopes, requests from nursing homes"
"Sen. Booker Introduces Bill to Transfer Land to Black Farmers"
"Tom Cotton: Biden DHS Nominee Mayorkas Disqualified to Lead Agency for Selling Green Cards to Chinese Nationals"
"Trump pardons ex-National Security Adviser Flynn"
"Joanna Williams: Covid restrictions show we're willing to kowtow to authority"
"BREAKING: TREASON: GA Gov. Kemp and CA Gov. Newsom bought off by communist China in covid supplies kickback and money laundering schemes"
"Monty Python's John Cleese In Defense Of Author J.K. Rowling: 'I'm Not That Interested in Trans Folks'"
"Biden Team Hopes to Reverse Trump's Policies and Return America to Endless Wars, Stagnation and Despair [Satire](but not really)"
"Judge orders Pennsylvania halt certification of election results as fight over mail-in ballots continues"
"Following The Election, Facebook Tightens Choke On News Outlets It Disagrees With -- Sources such as CNN, The New York Times, NPR, and others benefitted from Zuckerberg's changes, receiving more traffic and distribution on the site while conservative news artificially lost page views and reach."
"Douglas Murray: It's liberal hysteria to think cutting foreign aid will turn UK into an international pariah"
"Pennsylvania Judge Blocks State From Certifying Election Results For POTUS And All Other Races"
"Rep. Ilhan Omar turns in worst underperformance for House candidate in the country"
"Computer repairman at center of 'Biden laptop' scandal closes shop, disappears amid purported death threats"
"India ban more Chinese apps and China Criticize | Flash News"
"Nevada Lawsuit Claiming Illegal Ballots Cast Has a Trial Date December 3rd"
"Politicians' Attacks On Thanksgiving Gatherings Are Not 'Data-Based,' Epidemiologists Say"
"After Years Of Russia Hoax Persecutions, Trump Pardons Michael Flynn"
"President Trump 'is planning to pardon his national security adviser Michael Flynn'"
"Analysis - Pennsylvania Judge Blocks Election Certification Over Constitutionality of Mail-In Voting"
"TREASON: GA Gov. Kemp and CA Gov. Newsom bought off by communist China in covid supplies kickback and money laundering schemes"
"NYC to Have Coronavirus Checkpoints, Sheriff Warns of 'Consequences' for Violating Quarantine"
"Alyssa Milano's Attempt To Make Peace With Trump Supporters Backfires"
"CNN's serious journalist Bryan Stelter says conservatives joining Twitter alternative, Parler, is a \"threat to Democracy\""
"New Pennsylvania coronavirus measures include stay-at-home advisory, Thanksgiving Eve ban on alcohol sales at bars and restaurants"
"Dr. Mike is called out for hypocrisy after he's seen partying maskless"
"Allister Heath: UK is facing ruin, as a result of Covid Response"
"Trump pardons former national security adviser Michael Flynn"
"Biden Will Propose 'Path to Citizenship' For 11 Million Illegals First 100 Days in Office, Likely Trigger New Border Crisis"
"Trump Legal Team Scored a Big Win in Nevada. Could It Lead to a 2020 Bombshell?"
"David Aaronovitch: Infantile obsession with walkouts and martyrdom proves UK's left isn't interested in real business of politics"
"BLM Protester Who Spat in Cop's Face Walks Free After Apology"
"Florida Democrats Praying to Satan in the House Chamber"
"Pittsburgh forms Coronavirus task force to enforce guidelines"
"2020 Election Fraud Evidence Compiled"
"The Year 2020 Was A NightMare; Should We Be Thankful This Thanksgiving?"
"Donald and Melania Trump heckled by reporters at Thanksgiving turkey pardon ceremony: Donald Trump and First Lady Melania were all smiles at a Thanksgiving event at the White House despite heckles from reporters"
"U.S. Weekly Jobless Claims Jump to 778,000"
"Breaking!! Group Files Emergency Petition in Wisconsin After Identifying 150,000 Potentially Fraudulent Ballots found by statistician Matthew Braynard and mathematician Steven Miller. (New video in comments with complete statistical results in all contested states!)"
"Afghan Vet Johnny Jones On Biden's Gun Control Plan: That'll Trigger 2022 GOP Landslide"
"Penguin Random House staffers broke down in tears over release of Jordan Peterson book: report"
"Los Angeles Bans Outdoor Dining Without Evidence Linking It to New Cases"
"Barack Obama: Pro-Trump Latinos Cling to Religion"
"Nolte: Only 3% of Trump Voters Believe Joe Biden Is Legitimate Winner"
"Pennsylvania governor halts alcohol sales day before Thanksgiving"
"Trump team wins hearings in Arizona, Michigan and Pennsylvania legislatures on election concerns"
"Biden's Policy Proposals Would Harm Economy"
"CNBC/Change Poll: Only 3 Percent Of Trump Voters Consider Election Legitimate"
"UK Covid Cops Bust Women's Dinner Party"
"For Anti-Racism, San Diego Schools Will Teach Black, Hispanic Kids Less"
"Pennsylvania Certifies Nov. 3 Election Results, Gov. Wolf Says"
"State Republican Steps Down Only Three Weeks After Winning Reelection"
"This young Cuban man responds to AOC."
"After President Trump Gets Setback In Pennsylvania - The 3rd Circuit Court Just Granted Donald An Expedited Review"
"YouTube Suspends OAN as Liberal Senators Call for Censorship"
"5 things to know about NY Gov. Andrew Cuomo's coronavirus nursing home controversy"
"Oregon Gov: People Should Report Neighbors' Thanksgiving Gatherings With Too Many People"
"German Minister of Defence: President Trump was correct to pressure Germany to spend more on defense"
"Sen. Booker Introduces Bill to Transfer Land to Black Farmers"
"In GA, during Sept, Dominion's radical Leftist Eric Coomer made a \"critical software change\" to GA's Dominion voting machines \"without adequate testing or certification from the U.S. Election Assistance Commission\"."
"Obama to be honored by PEN America with Voice of Influence Award. During the ceremony, Obama will discuss freedom of expression and the importance of truth in a world of misinformation."
"Sidney Powell Wants Zoom Meeting Where Georgia Official Refused Audit"
"COVID crackdown underway as 'substantial' restrictions coming to NYC"
"Is there any doubt that Trump was right to fire James Comey?."
"New Lockdown a Blow to Philly Restaurants"
"CDC may shorten recommended COVID-19 quarantine period to between 7 and 10 days"
"LA Public Health unable to provide data to support outdoor dining restrictions when pressed by county leader"
"Poll Shows Growing Democratic Opposition to Cheap Labor Migration"
"Georgia voters registered at postal, commercial addresses that appeared to be residential, study"
"Swing State Woes: Conservative Group Says They Discovered 150,000 Fraudulent Ballots In Wisconsin"
"'Faulty Upload' Changes Unofficial Vote Totals In AZ, Gets Fixed"
"Congress Just Got Swept By A Red Wave - Out Of 27 'Toss-Up' House Races, The Republicans Took All Of Them"
"California Paid Millions for Unemployment Claims in Prisoners' Names, Prosecutors Say"
"California paid up to $1 billion in fraudulent unemployment claims to prisoners - including death row inmates"
"Black Lives Matter Leader Calls L.A. Mayor Garcetti A 'Liberal White Supremacist,' Speaks Out Against Potential Cabinet Appointment"
"Biden National Security Adviser Pick Said \"Al-Qaeda Is On Our Side\" in Syria"
"Hillary Clinton among names being considered for Biden Secretary of defense."
"Proposal Seeks To Prohibit Gatherings In LA County As Pandemic Surges"
"WATCH: Fulton County Poll Manager Susan Voyles Recounts Election Improprieties in Georgia Recount"
"One Nation Under Google: How Google Can (and Does) Change Election Outcomes"
"President Trump plans to pardon Michael Flynn: Reports"
"The New Woke Times"
"Poll: Just 3% of Trump voters believe Biden won fairly, 73% think Trump is the legitimate winner"
"Biden's win in Nevada certified by Nevada Supreme Court"
"Sharyl Attkisson on Big Tech Censorship: Sheep Are Happy to Live in Artificial Reality"
"New Virginia study finds online schooling is severely damaging students' academic achievement"
"State Governor Frees All Drug Dealers To Provide Prison Space For Families Celebrating Thanksgiving"
"Vermont to question schoolchildren over Thanksgiving gatherings, and require quarantine for violators"
"U.S. republic needs loyalty, confidence of its citizens"
"Rigged-election claims in Georgia fuel Republican fears of losing Senate"
"Watch-Joe Biden: Amnesty for Over 11 Million Illegal Aliens Going to Senate in My First 100 Days"
"President Obama Shares His Disappointment in Evangelical Hispanics Who Voted for Trump"
"Lin Wood Subpoenas Georgia Officials For Video Evidence"
"BLM leader in Breonna Taylor protests fatally shot in carjacking : TheGrio"
"Alyssa Milano extends 'olive branch' to Trump supporters after months of scathing rebukes"
"Patrick Byrne lays out summary of the Dominion-related evidence he has provided Sidney Powell ahead of her filing suit in GA. While additional angles of attack are hinted at by Powell, this is what she's working from regarding Dominion."
"Scarborough on Operation Warp Speed: Trump's Legacy on 'Could Be Considered an Unqualified Success'"
"Fifth Circuit Permits Texas and Louisiana to Defund Planned Parenthood"
"Journalist says Gavin Newsom's COVID-snubbing dinner party was far worse than reported: Attendees now 'privately laughing' at controversy'"
"Predicting a second Trump term, Sidney Powell says 'massive' Georgia lawsuit coming by Thanksgiving eve"
"Rand Paul says the 'vast majority' of voting must be in person to mitigate potential for fraud"
"Nearly a Tenth of Biden Voters in Key States Would Not Have Voted for Him Had They Known About Hunter Biden Scandal"
"The Return of Obama-Biden Energy Cronyism. Green lobbyists and other Obama favorites are about to enter a new golden age."
"Senator Cory Booker Introduces South Africa Style Land Re-Distribution Bill"
"Pennsylvania, Arizona and Michigan state leglislatures to hold hearings on 2020 election"
"Sidney Powell Keeps Telling Kids Their Christmas Presents Are Going To Make Their 'Freaking Heads Explode'"
"The Numbers Don't Lie (about racial crime rates)"
"Pennsylvania, Arizona, Michigan Legislatures to Hold Public Hearings on Election: Trump Campaign"
"White House press caught laughing at McEnany and Trump -- 'They got COVID. They lost the election'"
"Dominion Executive: Trump is not going to win. I made f***ing sure of that."
"Who Really Runs The Drudge Report?"
"Commentary: Harvard Researchers: Nearly Half of Young Adults Showing Signs of Depression Amid Restrictions"
"Scott Peterson, CA death-row inmates got COVID-19 benefits in massive scam: report"
"Feinstein drops out of Democratic leadership in Senate"
"Massachusetts Democrats Push Unlimited Abortion in Annual Budget -- The amendments would expand abortion after fetal viability and erase parental-consent requirements for minors seeking abortions."
"Biden: Amnesty for 'Over 11M' Illegals Going to Senate in First 100 Days"
"Trump Lawyers Want Rudy Giuliani to Argue in Federal Court Again: Document"
"Europe must not succumb to the Soros network"
"Biden's Homeland Security pick flagged by whistleblowers for preferential treatment with visas"
"Group files emergency petition in Wisconsin after finding 150,000 potentially fraudulent ballots"
"Media fawns over Biden's Cabinet rollout, describes 'being rescued from this craziness' by 'superheroes'"
"Election observers given poop emoji wristbands during vote recount in Wisconsin"
"PA Rep. Guy Reschenthaler: Pa. Certifying Tainted Results 'Reckless' -- \"Secretary Boockvar said Pennsylvania was going to go to Joe Biden before voting even started.\""
"New Mexico governor shuts down grocery stores with new public health order"
"Democrats keep getting caught breaking their own coronavirus rules"
"Even If Mad About Election, Don't Sit Out Georgia Runoffs"
"The same people who said locking down the border to stop covid conveniently fits trump's agenda are the same ones pretending that stop thanksgiving travel doesn't fit their anti colonial narrative."
"'That was weird as s***': White House reporters left bemused by Trump's press appearance"
"WATCH: Uzbekistani Migrant Rescued from Texas Border River"
"Biden Announces He Will Immediately Move To Give Citizenship To Millions Of Illegal Aliens"
"Gov. Cuomo Cancels Thanksgiving with His 89-Year-Old Mother After Backlash"
"NYC's COVID checkpoints are back: Cops out 'in force' at travel spots"
"Michigan County Board Approves Resolution to Impeach Gov. Whitmer - Truly Times - Conservative News"
"FBI Buried Hunter Biden Laptop: It's unlikely there was ever any investigation at all."
"OAN Responds After YouTube Temporarily Bans, Demonetizes Outlet Over 'Unlisted' COVID-19 Video"
"Citi Joins Mastercard In Allowing Transgenders To Use Their 'Chosen Name' Without Legal Change"
"Report: President Trump Plans to Pardon Michael Flynn"
"US election 2020: Biden says White House co-operation 'sincere'"
"In Seattle, 34 more officers ditch the force as city slashes police budget for a second time"
"Biden's New Secretary Of State Could Be In Trouble - Emails Show Hunter Biden Requested Meeting With Blinken"
"Antifa leader threatens 'armed' action against Trump supporters -- 'If you do not concede by Sunday at noon, we will begin to block roads'"
"In GA, during (late?) Sept, Dominion's radical Leftist Eric Coomer made a \"critical software change\" to GA's Dominion voting machines \"without adequate testing or certification from the U.S. Election Assistance Commission\". From this 9/29/20 AJC story"
"New Arkansas bill to criminalize nearly all forms of abortions"
"CNN silent as nurse's viral tale of patients denying coronavirus from deathbeds falls apart"
"Republicans Sue to Stop Wisconsin Vote Certification"
"After Fending Off Pandemic Challenger, Planned Parenthood Retains Title For Most Americans Killed In 2020"
"Scientific Analysis of PA Election Funds Major Statistical Anomalies, Likelihood of Unreliable Results in 5+ Counties"
"New Mexico governor shuts down grocery stores for two weeks"
"Potential Joe Biden White House Staffer Justified Palestinian Suicide Bombers"
"Pope Francis backs George Floyd protests, slams COVID-19 skeptics in book"
"Kamala's Replacement In the Senate Could Be Determined By a Critical Person From Her Past: Former San Francisco Mayor and Assembly Speaker Willie Brown"
"Joe Biden is reviving all of his past failures - and it won't stop"
"California Pastor Temporarily Turns His Chapel Into a Strip Club to be Deemed \"Essential\""
"Republican Sen. Perdue says he would fly AOC to Georgia to campaign for his Democratic opponent."
"US can kill its own citizens without review when state secrets are involved, DOJ lawyer argues"
"Trump told confidants he intends to pardon Michael Flynn: report"
"Virginia Study: Remote Learning Damaging Students' Education"
"Thousands in Georgia Registered at Postal, Commercial Addresses, Portraying Them as Residences, Researcher Says"
"Sidney Powell: A \"massive\" lawsuit is coming in Georgia tomorrow that'll save Trump's presidency"
"Report: Facebook hatched 'emergency' plan using 'secret internal ranking' to suppress 'right-wing' news sources post-election"
"Is fame going to Gov. Andrew Cuomo's head?"
"Group Files Emergency Petition in Wisconsin After Identifying 150,000 Potentially Fraudulent Ballots"
"U. of Virginia Student Newspaper: Stand Up to 'Racist' Family at Thanksgiving"
"Trump reportedly set to pardon Michael Flynn"
"McConnell Pushing Forward, Relentlessly Confirming Judges"
"Media Censoring Negative Biden News May Have Cost Trump The Election Swing State Poll Shows"
"New Petition filed w/court from AZ GOP: filed a petition today with the Court to allow early inspection"
"Data Scientist Flags Around 90,000 Votes in Pennsylvania"
"Attorney [Lin Wood] Challenging Georgia Election Outcome Appeals Case"
"Sheriff Donny Youngblood says KCSO will not respond to calls for large gatherings"
"Penguin Random House Employees Cry Leftist Tears Over Release Of New Jordan Peterson Book"
"WALSH: New HBO Documentary On 'Transkids' Accidentally Tells Disturbing Truth"
"Just Hours After Being Placed In Cuomo's Possession, Emmy Statue Dies Of COVID. \"The Emmy was placed in a nursing home for safekeeping and almost immediately contracted the virus, passing away just hours later\""
"Some college students plan to 'educate' conservative family members about their political, social views over Thanksgiving"
"Twitter decided to censor posts that 'could undermine faith' in election process before a single vote was cast on election day"
"Joseph Nye: \"Trump deserves credit for pushing back on China's abusive trade practices, but it would have been better if we worked with our allies to isolate China. Also, his trade deal has been costly for Americans without changing the trade imbalance or addressing technological issues.\""
"The Revenge of The Swamp! Biden Lefty Transition, Big Tech Censorship, Truth &amp; Reconciliation!?(The Happy Warrior Podcast)"
"Tucker Carlson Has Epic Rant About the Real Theft of the Election: \"The system was rigged against one candidate\" (Trump agrees)"
"Biden Picks Swamper Who Falsely Accused Michael Flynn of Russian Collusion as National Security Advisor"
"Mitt Romney Should Be Getting Nervous - His Senate Seat Could Be Challenged By Conservative Actor Scott Baio"
"Sidney Powell plans to file Georgia election-related lawsuit 'no later than tomorrow'"
"Rashida Tlaib accused of anti-Semitism for reaction to Biden's Jewish Sec of State nominee"
"Georgia secretary of state: My family voted for Trump. He threw us under the bus anyway."
"Hours After Gov. Newsom Enacts California Order - \"Curfew Crashers\" In 16 Cities Flood The Golden StateStreets"
"Republicans should make AOC House Speaker | Spectator USA"
"New Congresswoman Creates a Furor by Asking About Her Second Amendment Rights"
"Biden Announces He Will Immediately Move To Give Citizenships To Millions Of Illegal Aliens"
"Feinstein to Step Down as Ranking Judiciary Dem after Progressive Disappointment with Barrett Hearings"
"Election fraud to any degree destroys trust"
"Treasury, Reserve Bank told Government it could just print money to pay for Covid-19"
"Laura Ingraham: I regret to inform you that Biden will be president"
"Lurch Is Back: Biden Picks John Kerry To Be His 'Climate Envoy'..."
"NYC Will Have Covid Checkpoints at Key Bridges and Crossings"
"Psychologist And Search Engine Expert Robert Epstein: Google Shifted a 'Minimum' of 6 Million Votes in 2020"
"Xi Focus: Xi stresses military training to raise capability of winning wars - Xinhua | English.news.cn"
"Where are the Republican Politicians? Have they Deserted Trump?"
"Trump vows he'll 'never concede' despite administration starting transition move"
"Heritage Tech Expert Exposes TikTok's China Ties on '60 Minutes'"
"Trump Administration To Start Transition Process For Biden"
"Why Does Gov. Andrew Cuomo Continue To Single Out Jews?"
"Pennsylvania, Nevada certify election results for Biden despite Trump legal challenges"
"Maxine Waters Pushes for Investigation of 'Criminal' Trump To 'Send a Message Across the World'"
"Rush Limbaugh: Obama is dark force who created shadow government -- 'He literally was undermining a duly elected president'"
"[Long Audio] Great chat with officers while being fingerprinted for my holding a sign arrest [Canada]"
"Federal Appeals Court: Texas, Louisiana Can End Planned Parenthood Funding"
"Pushed Out? Feinstein Stepping Down As Lead Democrat On Judiciary Committee Following Left-Wing Criticism"
"Huge court win lets Trump present ballot evidence, could overturn Nevada result"
"Post-George Floyd, a Wave of 'Anti-Racist' Teaching Sweeps K-12 Schools Targeting 'Whiteness'"
"Urban-Rural Divide Shapes American Culture &amp; Politics"
"Trump campaign continues to fight as more evidence of voter fraud emerges"
"Black Republican Opponent Expected to Defeat Stockton's Popular Democratic Mayor Michael Tubbs"
"US should encourage China's rise, Biden national security pick Jake Sullivan says"
"Potential Joe Biden White House Staffer Justified Palestinian Suicide Bombers"
"'No Masks, All Indoors': Award-Winning Journalist Claims 22 People Attended Newsom Dinner, Not 12, $15k Bar Bill"
"Errors, 'Scams' Led California To Send Millions In COVID Unemployment Benefits To Prisoners, Death Row Inmates"
"Letter from the online trenches | Spectator USA"
"Rush Limbaugh criticizes Trump legal team for promising 'bombshells' and failing to deliver"
"FNC's Laura Ingraham: 'I Would Be Lying to You' if I Said There Was an 'Excellent' Chance SCOTUS Delivers Victory to Trump"
"Group Files Emergency Petition in Wisconsin After Identifying 150,000 Potentially Fraudulent Ballots"
"New Virginia study finds online schooling is severely damaging students' academic achievement"
"Some hope in Canada."
"Did you know that Arizona's first new law in 2020 was emergency legislature which passed unanimously to allow \"Digital Adjudication\" to be used in Maricopa county for the presidential election?"
"Edward Solomon reverse-engineered the Dominion Voting Algorithm"
"Tlaib denounces Pompeo's decision to recognize BDS as antisemitic"
"Alleged Money Trail from China to Georgia Hints at Rigged Results and Certification Flip-Flops"
"US Drafts List of 89 China Firms With Military Ties"
"Lord Acton on the enduring significance of the American Revolution"
"Hawley 2024? Missouri Republican could be 'Trump 2.0,' say conservative supporters"
"Trump lawsuit confuses Michigan and Minnesota locations in affidavit claiming voter fraud"
"AOC and Ted Cruz clash over stalled COVID-19 relief bill"
"Get ready for major backlash to the next wave of lockdowns. As public-health experts have largely jettisoned any claim to public trust."
"Mattis says he hopes Joe Biden takes 'America First' out of national security strategy"
"FAKE NEWS: ABC, NBC Suck Up to 'Diverse' Biden Picks as 'Mainstream,' 'Not Political'"
"A Scold Day in Hell: Progressives Poised to Ruin Your Thanksgiving with Political Lectures"
"Pope Francis Defends BLM Protests, Denounces Anti-COVID Lockdown Protests"
"All SUNY Students Must Test Negative for COVID Before Thanksgiving Break: Chancellor"
"China pays US outlets to spread China Propaganda"
"Blame Trump: Politico Tries to Cover for Potential Biden Econ Failure"
"Rush Limbaugh On Trump's Legal Team: 'They Promised Blockbuster Stuff And Then Nothing Happened'"
"When It Comes to Election Fraud, It's 'Hear No Evil, See No Evil, Speak No Evil'"